// ? Використовуючи prompt задайте питання, на яке можна відповісти "так" чи "ні"
// ? Випадкове число для відповіді генерується функцією Math.floor(Math.random() * 5)
// ? Використовуйте switch для створення випадкових відповідей, де:
// ? 0 - 'Все будет ОК'
// ? 1 - 'Може так, а може ні'
// ? 2 - 'Певно, ні'
// ? 3 - 'Дуже ймовірно'
// ? def - 'Я нічого про цк не знаю'
// ? Вивести відповідь із запитанням ("Поставлене запитання - question.
// ?  Шар думає, що - answer")
let question = "";
let answer = "";
let i = "";

let getGame = confirm("Тебе щось тривожить дитино моя?");

switch (getGame) {
  case false:
    alert("То якого ... ти сюди приперлось?");
    break;
  case true:
    for (i = 0; i <= 5; i += 1) {
      question = prompt(
        "Що ж тривожить твою гнилу душу? (лише питання закритого типу)"
      );
      switch (question) {
        case null:
          alert("Не ігнор мене падлюко! Нужбо задавай питання! Тільки не став ПРОБІЛ");
          break;
        case " ":
          alert("Господи! Яке ж воно кончене ...");
          break;
        default:
          const random = Math.floor(Math.random() * 6);
          switch (random) {
            case 0:
              answer = "Прислухайся свого серця!";
              break;
            case 1:
              answer = "Ееееее.... а біс його знає!";
              break;
            case 2:
              answer = "Таке дурне тільки ти можеш запитати ...";
              break;
            case 3:
              answer = `"До поки сонце сяєє, до поки ....." ну далі ти знаєш`;
              break;
            case 4:
              answer = `"Я зеленого поняття не маю про що мова =)`;
              break;
          }
          alert(
            `Мольфар Єфродозій віщає що - ${answer} (Поставлене запитання - ${question}???.)`
          );
          break;
      }
    }
    break;
}
